// В конфиге прописаны 4 вещи. Первая вещь - переменные для проги - просто числовые значения,
// которые используются в разных ее частях. Пишутся только англ. буквами,
// от значения отделяются знаком равно. Значение может быть дробным, в этом случае
// для отделения дробной части используется точка. Все шансы указываются в процентах
// Если переменная не указана в конфиге, но она используется в проге - тогда в проге ей присваивается
// дефолтное значение. Чаще всего 0, или нулевая строка. Так что можно просто не писать переменные,
// у которых вы хотите получить нулевое значение. Еще одна пометка - сохраняйте конфиг в Юникоде, если
// будете создавать новый. Если файл будет не в Юникоде - прога его не прочитает. Вернее прочитает,
// но ничего не поймет.)
// И еще, к слову. Чтобы прога запустилась - дефолтный конфиг обязателен. Я могу это убрать,
// но тогда вы вообще, сучечки, распоясаетесь, должны же быть какие-то правила.)

// Работает программа в 2-х режимах. Режиме работы с окошками, когда вы вставляете текст в
// первое окошко, нажимаете кнопку, прога выдает вам результат, и режиме буфера обмены,
// когда вы можете вообще свернуть прогу, и она автоматически будет весь текст, который
// попадает в буфер обмена, обрабатывать, и после этого вставка будет уже измененного текста.
// В режиме буфера обмены вывод результатов в окошки тоже производится, и активна кнопка
// ОТУПЯЧИВАНИЯ, так что если вам не понравился результат - можете нажать эту кнопку и
// текст ОТУПЯЧИТСЯ заново, опять же помещая новый результат в буфер.

// Также файл конфига можно просто кинуть на окошко программы, и тогда будет использоваться этот
// конфиг.

// Если включить режим генератора лучей поноса и режим работы с буфером обмена - то через
// равные промежутки времени (задаваемые в поле "Интервал") автоматически будет генерироваться текст,
// выводиться в окошки, а также помещаться в буфер обмена.
// Интервал задается в миллисекундах(ну, или в их десятых - не уверен)).
// То есть 1000 миллисекунд - 1 секунда. Соответственно, 500 - полсекунды.
// Меньше 100 ставить я запретил, так как иначе Windows не будет успевать открывать
// буфер обмена.

// Комментарии - это то, что предназначено именно для людей читающих этот конфиг. Например
// эти строки - это и есть комментарии. Программа их игнорирует при считывании.
// Комментарии в конфигах могут быть 2-х видов: // - когда программа считает, что комментарий - это все
// от этих символов и до конца строки, и /* */ , когда программа считает, что комментарий - это все от
// символов /* и до символов */, не важно, на каких строчках они находятся и в каком месте.

// Шанс того, что слово станет полностью заглавным
Capitalization Chance = 25

// Число, больше которого все числа заменяются
Number To Replace = 10000

// Строка, на которую заменяются числа больше, чем Number To Replace
Number Replacement String = СТОПИЦОТ

// Шанс, что числа больше Number To Replace заменятся на Number Replacement String
Number Replacement Chance = 100

// Шансы на рандомную вставку проверяются перед каждым словом.
// Сначала проверяется, что будет 3 вставки,
// потом, если не прошло, - тогда то, что их будет 2, и т.д.
// Если не прошел ни один - вставок не будет
// Могут быть дробные значения
Three Additions Chance = 0.2
Two Additions Chance = 1
One Addition Chance = 2

// Минимальная длина слова, к которому может быть добавлена рандомная вставка.
// Должно быть целое значение, если будет не целое - будет округление
Min Word Length For Addition = 3

// Вторая вещь, прописанная в конфиге, самая главная - замена слов.
// Начинается с двойной кавычки, заканчивается другой двойной кавычкой, в них пишется слово,
// которое заменяется, потом идет в двойных кавычках слово, на которое может замениться
// исходное слово, потом через двоеточие пишется шанс (в процентах) того, что будет произведена именно
// эта замена (или что замена вообще будет произведена), если общая сумма шансов будет
// больше 100, то тогда те варианты, которые выходят за 100, не будут использоваться.
// Вариантов может быть несколько, пишутся они через запятую в таком же формате.
// Если заменяемое слово другое, а замены такие же, как в предыдущей строчке, то
// можно написать исх. слово в кавычках, а вместо списка замен написать *UP*, тогда
// программа будет использовать предыдущий набор значений. Исходное слово и результат
// могут быть написаны в любом регистре. Только в случае исходного слова будет проверяться
// само слово, не обращая внимания на регистр (то есть слова ЖиВТоНе и живтоне - одно и то же),
// а результат будет использован точно в том регистре, в каком написан.
// Шанс можно не писать если результаты (или результат) в сумме должны иметь 100% и иметь равный шанс.
// То есть если вы не написали шанс, то шанс этого слова автоматически станет равен (100% / кол-во слов).

// Можно использовать *, как в поиске Windows, она означает что на этом месте может
// быть от 0 до ОХУЕННОБОЛЬШОГОКОЛИЧЕСТВА символов. В слове может быть куча звездочек,
// сколько вам, идиотам, нравится.

// На символ ~ не обращайте внимания - это пока что нереализованная фишка.

// Также есть символ &, он должен встречаться только в одном экземпляре и только в самом начале,
// или в самом конце слова. Он означает, что на месте & может быть от 1 до ОХУЕННОБОЛЬШОГОКОЛИЧЕСТВА
// символа, И, ГЛАВНОЕ, что эти символы будут сохранены после замены, то есть будет изменено только
// то, что в исходном слове идет перед или после этой фигни. С помощью этой фишки можно легко менять
// окончания или приставки слов без изменения самого слова.

"радио" = *SAVE*

"животное" = "живтоне", "жевтоне", "животне", "жевотне"
"зверь*" = *UP*
"животные" = "живтони", "жевтони"
"звери" = *UP*
"тело" = "телоид"
"тела" = "телоиды"
"тел" = "телоидов"
"пост&" = "потс", "псто"
"действительн*" = "реальне", "реальни", "риальни", "риальне"
"." = "!!!!1111", "!!11", "!!!1111адинадин", "!1111!1!11адинадинадин", "!1!!!!11адин"
"!" = *UP*
"?" = "777????7", "7??7?", "????7777семьсемь", "???777777"
"что" = "чочо"
"че" = *UP*
"вселенн*" = "голактеко"
"галактик*" = "голактеко"
"опасност*" = "опасносте"
"безопасност*" = "безопасносте"
"неопасност*" = "безопасносте"
"анатоли*" = "Онотоле", "Онотолей"
"чак" = "Чаке"
"путин" = "Краб": 50
"медведев" = "Шмеле": 50
"экслер&" = "Эекстелр"
"волосат*" = "Кудряшка"
"кудряв*" = *UP*
"спячк&" = "упячк"
"подожд&" = "обожд"
"повремени&" = "обожда"
"помедли&" = *UP*
"погоди&" = *UP*
"смысл" = "соль"
"идея" = *UP*
"значение" = *UP*
"резон" = *UP*
"смысла" = "соли"
"идеи" = *UP*
"значения" = *UP*
"резона" = *UP*
"смыслом" = "солью"
"идеей" = *UP*
"смыслами" = *UP*
"идеями" = *UP*
"значением" = *UP*
"резоном" = *UP*
"значенями" = *UP*
"резонами" = *UP*
"жж" = "жежешечка"
"контакте" = "контактик"
"лиру" = "лирушечка"
"хорош*" = "мжвячне"
"удачн*" = *UP*
"круто" = *UP*
"приятн*" = *UP*
"неплохо" = *UP*
"недурно" = *UP*
"славно" = *UP*
"плохо&" = "сиране"
"сран*" = *UP*
"говен*" = *UP*
"нехорошо" = *UP*
"дурно" = *UP*
"скверно" = *UP*
"деньги" = "пепяка"
"авторитет" = *UP*
"карма" = *UP*
"рубли" = *UP*
"доллары" = *UP*
"рейтинг" = *UP*
"денег" = "пепяки"
"авторитета" = *UP*
"кармы" = *UP*
"рублей" = *UP*
"долларов" = *UP*
"рейтинга" = *UP*
"деньгами" = "пепякой"
"авторитетом" = *UP*
"кармой" = *UP*
"рублями" = *UP*
"долларами" = *UP*
"рейтингом" = *UP*
"рубль" = "пепяку"
"карму" = *UP*
"доллар" = *UP*
"рейтинг" = *UP*
"приглашение" = "Инвайте"
"лепр*" = "Миф": 50
"танец" = "пепякоданс", "пепякодансе", "упячкодансе", "танце"
"раздвин&" = "разуплотн"
"провалена" = "слита"
"провал&" = "сли"
"запомн*" = "в мемариз", "в нетленку"
"главн*" = "глагне"
"зачет*" = "в нетленку"
"глупость" = "тупак", "унылое говно"
"грустн&" = "уныл"
"скучн&" = *UP*
"тосклив&" = *UP*
"печальн&" = *UP*
"несчастн&" = *UP*
"стыд*" = "ебани стыд", "ёбаный стыд"
"позор*" = *UP*
"кошмар*" = *UP*
"ужас*" = *UP*
"одумай&" = "попяч"
"покай&" = *UP*
"одумать&" = "попячт"
"покаять&" = *UP*
"попят&" = *UP*
"кот*" = "котэ"
"кошк*" = *UP*
"краб*" = "крабе"
"шмель" = "шмеле"
"хуй" = "хуйс"
"член" = *UP*
"хуи" = "хуйсы"
"члены" = *UP*
"хуев" = "хуйсов"
"членов" = *UP*
"хуем" = "хуйсом"
"членом" = *UP*
"хуями" = "хуйсами"
"членами" = *UP*
"сука" = "сучка", "сучечка"
"чат&" = "упячкочат", "упячкочят"
"твой" = "тыой": 50
"ебаный" = "яебанейу", "ебанейу", "ебанею", "ебаней"
"как~бы" = "как бэ", "каг бе", "как бе"
"бы" = "бэ": 33, "бе": 33
"рад*" = "тешится"
"доволен" = *UP*
"счастлив*" = *UP*
"довольна*" = *UP*
"радуется" = *UP*
"ру" = "сру", "с.р.у."
"ru" = *UP*
"тут" = "тутся": 50
"здесь" = *UP*
"захвачен&" = "зохвачен"
"жопа" = "жепь"
"попа" = *UP*
"жопой" = "жепью"
"попой" = *UP*
"жопами" = *UP*
"попами" = *UP*
"лол" = "жажа"
"смешно" = "жажа"
"рот" = "щячло"
"рт&" = "щячл"
"один" = "адинадин": 25, "адин": 75
"воин&" = "воен"
"военный" = *UP*
"военные" = "воены"
"военными" = "военами"
"очки" = "чочочки"
"очочки" = *UP*
"в" = "": 25

// Чтобы сохранить слова от изменения - нужно раньше, чем это изменение
// может произойти, написать замену этого слова на само себя (можно использовать тэг *SAVE*).
// В случае слова "мы", мы спасаем его от изменения на "ме" из-за замены окончания
// "ы" на "е", которая прописана чуть дальше

"мы" = *SAVE*
"вы" = *SAVE*
"ты" = *SAVE*
"не" = *SAVE*
"нет" = *SAVE*
"или" = *SAVE*
"*того" = *SAVE*
"*много" = *SAVE*
"*кого" = *SAVE*
"чтобы" = *SAVE*
"идет" = *SAVE*
"лет" = *SAVE*
"цвет" = *SAVE*
"ответ" = *SAVE*
"заявил" = *SAVE*

"&ого" = "е", "и"
"&ая" = *UP*
"&ил" = "ел": 75
"&е" = "э": 25
"&и" = "е": 75
"&ы" = "е": 75
"&ые" = "и": 75
"&ие" = "и": 75
"&ый" = "и": 75
"&ер" = "ре"
"&ет" = "е": 75, "э": 25

// Третья вещь - это рандомные вставки. Заключаются в тильды, после двоеточия
// пишется шанс (относительно других вставок, этот шанс не в процентах) того, что
// будет вставлена эта вставка. Я бы скорее в этом случае эти числа назвал приоритетами.
// Приоритет, если он не задан явно, делается равным 1, то есть его нужно писать только если
// он не равен 1.

~ОЯЕБУ~
~ЖЕПЬ ЕБРИЛО~
~СИСЬКЕ~ : 2
~ПОТС ЗАХВАЧЕН~
~МЖВЯЧЬ~ : 2
~ПРДУНЬ~ : 2
~ЪЕЧЧОЖА~
~БАЛЕТ~
~УПЯЧКА~ : 2
~УПЯЧКОЧАТ~
~ЩЯЧЛО~
~ГЛАНДЭ~
~ПЕПЯКА~
~ПОПЯЧТС~ : 0.5
~ПОПЯЧСЯ~ : 0.5
~СИРАНЕ~
~ЖАЖА~
~ПЫЩЬ~ : 0.2
~ПЫЩЩЩЩЩЩЬ~ : 0.2
~ПЫЩЩЩЩЩЩЩЩЩЩЩщЩЬ~ : 0.2
~GSOM~ : 0.2
~GSOMMMMMMMMMM~ : 0.2
~ЖЖЖЖЖЖЖЖЖЖЖЖЖЖЖ~ : 0.2
~КЛАЦ-КЛАЦ~ : 0.2
~ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ~
~ %юзернейм% ~
~ СВОБОДА! РАВЕНСТВО! УПЯЧКА! ~
~ С.Р.У. ~
~ Я ИДИОТ ~
~ УБЕЙТЕ МЕНЯ, КТО-НИБУДЬ ~
~ СУКА ~
~ как бэ ~ : 0.3
~ как бе ~ : 0.3
~ реальне ~
~ реальни ~
~ и, как бэ, да ~ : 0.5
~ и, да ~ : 2

// Ну, и, четвертая вещь - тэги. Пишется сначала открывающий тэг обрамленный вертикальными линиями
// (сделано для того, чтобы можно было использовать BB тэги, а не только html), потом шанс,
// что он будет открыт (проверяется перед каждым словом если тэг еще не открыт, для *КАЖДОГО* тэга), потом в 
// тэговых скобках пишется закрывающий тэг, потом шанс, который проверяется после каждого слова,
// что он будет закрыт. Шансы тут в процентах.
// Если тэг одинарный (например <cat>) - тогда поле закрывающего тэга оставляете пустым,
// а шанс закрытия ставите 100, чтобы этот тэг закрылся (ничего не добавляя в текст) и не мешал другим.
// Если нужны BB-теги - просто раскоменчиваете их и закоменчиваете html-теги - и все работает.

|<a href='http://upyachka.ru'>| : 5 |</a>| : 95
|<font color='#ff0000'>| : 15 |</font>| : 15
|<font size='35'>| : 5 |</font>| : 25
|<font size='45'>| : 8 |</font>| : 25
|<cat>| : 1 || : 100

/*
|[URL=http://upyachka.ru]| : 5 |[/URL]| : 95
|[COLOR=RED]| : 15 |[/COLOR]| : 15
|[SIZE=35]| : 5 |[/SIZE]| : 25
|[SIZE=45]| : 8 |[/SIZE]| : 25
*/